common/models/AdminModel.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `ch_admin` WHERE (`id`=1) AND (`status`=10)

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `ch_admin` WHERE (`username`='admin') AND (`status`=10)