common/models/GoodsCategoryModel.php

SELECT * FROM `ch_goods_category` WHERE `parent_id`='1'
---
    public static function hasChild($id = 0)
    {
        return self::findOne(['parent_id' => $id]);

SELECT * FROM `ch_goods_category` WHERE `id`='0'
---
    public static function getCatName($id)
    {
        $array = static::findOne($id);