common/models/GoodsBrandModel.php

    public static function getGoodsBrand()
    {
    	$array[''] = '请选择品牌';
    	$arr = self::find()->asArray()->all();
---
SELECT * FROM `ch_goods_brand`