common/models/GoodsTypeModel.php

SELECT * FROM `ch_goods_type`
SELECT * FROM `ch_goods_type` WHERE `id`='3'
---
    public static function getGoodsType($id = '')
    {
        if(empty($id)){
            $GoodsTypeList = (new \Yii\db\Query())
                ->from(self::tableName())
                ->all();
            $list[''] = '请选择商品类型';
            foreach($GoodsTypeList as $k => $v)
                $list[$v['id']] = $v['name'];

            return $list;
        }else{
            $model = self::findOne($id);