common/models/PostsCategoryModel.php

    public static function hasChild($id = 0)
    {
    	return self::findOne(['parent_id' => $id]);
---
SELECT * FROM `ch_posts_category` WHERE `parent_id`='1'